In [1]:
import pandas as pd
import numpy as np

In [3]:
students_performance = pd.read_csv('StudentsPerformance.csv')

In [4]:
students_performance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [5]:
students_performance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [7]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [8]:
students_performance.shape

(1000, 8)

In [9]:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [10]:
students_performance.iloc[0:3, 0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none

In [11]:
students_performance.iloc[[0, 3, 10], [0, 5, -1]]

    gender  math score  writing score
0   female          72             74
3     male          47             44
10    male          58             52

In [12]:
students_performance_with_names = students_performance.iloc[[0, 3, 4, 7, 8]]

In [14]:
students_performance_with_names.index = ["A", "B", "C", "D", "E"]

In [15]:
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
A,female,group B,bachelor's degree,standard,none,72,72,74
B,male,group A,associate's degree,free/reduced,none,47,57,44
C,male,group C,some college,standard,none,76,78,75
D,male,group B,some college,free/reduced,none,40,43,39
E,male,group D,high school,free/reduced,completed,64,64,67

In [17]:
students_performance_with_names.loc[["A", "C", "E"], ['gender', 'writing score']]

   gender  writing score
A  female             74
C    male             75
E    male             67

In [18]:
type(students_performance_with_names)

pandas.core.frame.DataFrame

In [19]:
type(students_performance_with_names.iloc[:, 0])

pandas.core.series.Series

In [20]:
students_performance_with_names.iloc[:, 0]

A    female
B      male
C      male
D      male
E      male
Name: gender, dtype: object

In [21]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [22]:
my_series_1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
my_series_2 = pd.Series([4, 5, 6], index=['A', 'B', 'C'])

In [23]:
pd.DataFrame({'col1': my_series_1, 'col2': my_series_2})

   col1  col2
A     1     4
B     2     5
C     3     6

In [24]:
students_performance_with_names['gender']

A    female
B      male
C      male
D      male
E      male
Name: gender, dtype: object

In [25]:
students_performance_with_names[['gender']]

   gender
A  female
B    male
C    male
D    male
E    male

In [30]:
students_performance.iloc[0:7]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [31]:
students_performance_with_names.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [38]:
students_performance_with_names.get_dtype_counts()

/home/kochkinnp/introduction_data_science/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

int64     3
object    5
dtype: int64

In [39]:
titanic = pd.read_csv('titanic.csv')

In [40]:
titanic.size

10692

In [41]:
titanic.shape

(891, 12)

In [42]:
titanic.get_dtype_counts()

/home/kochkinnp/introduction_data_science/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

float64    2
int64      5
object     5
dtype: int64

In [43]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q